window.PLACES = [
  "Cuddalore",
  "Chidambaram",
  "Panruti",
  "Virudhachalam",
  "Neyveli",
  "Kurinjipadi",
  "Bhuvanagiri",
  "Kattumannarkoil"
];

window.EVENTS = {

  FLOOD: {
    icon: "🌧",
    text: [
      "{{place}} பகுதியில் கனமழை. வீடுகள் நீரில் மூழ்கின.",
      "{{place}} கிராமங்களில் வெள்ள பாதிப்பு அதிகரித்துள்ளது.",
      "மழை காரணமாக {{place}} மக்கள் உதவி கேட்கிறார்கள்."
    ],
    choices: [
      { label: "🚑 மீட்பு குழு அனுப்பு", effect: g=>{g.popularity+=10;g.cash-=30000;} },
      { label: "💰 நிவாரணம்", effect: g=>{g.popularity+=6;g.cash-=50000;} },
      { label: "❌ புறக்கணி", effect: g=>{g.popularity-=15;g.morality-=5;} }
    ]
  },

  MEDIA: {
    icon: "📰",
    text: [
      "{{place}}-ல் உங்களை எதிர்த்து மீடியா விமர்சனம்.",
      "டிவி சேனலில் ஊழல் குற்றச்சாட்டு.",
      "சமூக வலைதளங்களில் ஆடியோ லீக்."
    ],
    choices: [
      { label: "மன்னிப்பு", effect:g=>{g.morality+=5;g.popularity+=2;} },
      { label: "மறுப்பு", effect:g=>{g.influence+=5;g.popularity-=5;} },
      { label: "மீடியாவை மிரட்டு", effect:g=>{g.influence+=10;g.morality-=10;} }
    ]
  },

  PROTEST: {
    icon: "🔥",
    text: [
      "{{place}}-ல் விவசாயிகள் போராட்டம்.",
      "வேலைவாய்ப்பு கோரி இளைஞர்கள் போராட்டம்.",
      "மக்கள் அரசு அலுவலகம் முற்றுகை."
    ],
    choices: [
      { label:"பேச்சுவார்த்தை", effect:g=>{g.popularity+=5;g.cash-=20000;} },
      { label:"போலீஸ் நடவடிக்கை", effect:g=>{g.influence+=8;g.popularity-=8;} }
    ]
  },

  INDUSTRY: {
    icon: "🏭",
    text: [
      "{{place}} SIPCOT பகுதியில் தொழிற்சாலை விபத்து.",
      "{{place}}-ல் மாசுபாடு குற்றச்சாட்டு."
    ],
    choices: [
      { label:"தொழிற்சாலை ஆதரவு", effect:g=>{g.influence+=6;g.morality-=5;} },
      { label:"மக்கள் பக்கம்", effect:g=>{g.popularity+=7;} }
    ]
  },

  TEMPLE: {
    icon: "🛕",
    text: [
      "{{place}} கோவில் திருவிழா நிதி தேவை.",
      "கோவில் நில விவகாரம் சர்ச்சை."
    ],
    choices: [
      { label:"நிதி வழங்கு", effect:g=>{g.popularity+=6;g.cash-=15000;} },
      { label:"அமைதி", effect:g=>{g.popularity-=3;} }
    ]
  }
};
